"""
Задание №3
Доработаем задачу 7 из урока 1, где бросали монетку, игральную кость и генерировали случайное число.
Маршруты могут принимать целое число - количество бросков.
Представления создают список с результатами бросков и передают его в контекст шаблона.
Необходимо создать универсальный шаблон для вывода результатов любого из трёх представлений.

Задание №4
Доработаем задачи из прошлого семинара по созданию
моделей автора, статьи и комментария.
Создайте шаблон для вывода всех статей автора в виде
списка заголовков.
○ Если статья опубликована, заголовок должен быть
ссылкой на статью.
○ Если не опубликована, без ссылки.
Не забываем про код представления с запросом к базе
данных и маршруты.

Задание №5
Доработаем задачу 4.
Создай шаблон для вывода подробной информации о
статье.
Внесите изменения в views.py - создайте представление и в
urls.py - добавьте маршрут.
*Увеличивайте счётчик просмотра статьи на единицу при
каждом просмотре

Задание №7
Доработаем задачу 8 из прошлого семинара про клиентов,
товары и заказы.
Создайте шаблон для вывода всех заказов клиента и
списком товаров внутри каждого заказа.
Подготовьте необходимый маршрут и представление.

Домашнее задание
Продолжаем работать с товарами и заказами.
Создайте шаблон, который выводит список заказанных
клиентом товаров из всех его заказов с сортировкой по
времени:
○ за последние 7 дней (неделю)
○ за последние 30 дней (месяц)
○ за последние 365 дней (год)
*Товары в списке не должны повторятся.


"""